johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
}
int checkFileType(char * file) {
  int type = 0;
  if (strstr(file, ".TBT") != NULL) {
    type = 1;
  } else if (strstr(file, ".BRF") != NULL) {
    type = 2;
  } else if (strstr(file, ".TXT") != NULL) {
    type = 3;
  }
  return type;
}
void searchFile2() {
  int readStatus = 1;
  //printf("Seaching............................\r\n");
  //SendCH370(ResetAll, sizeof(ResetAll)); //reset chip
  //printf("reset all\r\n");
  int time_check = 0;
  //maxFile = 0;
  while (readStatus) {
    if (command_ == 1) {
      SendCH370(checkConnection, sizeof(checkConnection));
      printf("Check Connection str %s\r\n", FileName_buffer);
      command_++; //2
      delay_ms(45);
    } else if (command_ == 2) {
      SendCH370(setSDCard, sizeof(setSDCard));
      printf("Set SD Card Mode\r\n");
      command_++; //4
      delay_ms(45);
    } else if (command_ == 3) {
      SendCH370(USBDiskMount, sizeof(USBDiskMount));
      printf(" USB Disk Mount\r\n");
      command_++; //6
      delay_ms(45);
    } else if (command_ == 4) {
      if (openDir("*")) {
        printf("seach all file sucess \r\n");
        command_ = 16;
      }
    }
    else if (command_ == 16) {
      nextAgain = 0;
      NextFile();
      command_++;
      countFileLegth = 0;
      //delay_ms(50);
    } else if (command_ == 22) {
      setFilename("/*");
      printf("Set * back to root Name\r\n");
      command_++; //8
      delay_ms(45);
    } else if (command_ == 23) {
      SendCH370(FileOpen, sizeof(FileOpen));
      printf("File Open\r\n");
      command_++; //7
      delay_ms(45);
    }
    keyRead();
    if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
      i1 = USART_ReceiveData(USART3);
      //printf("\r\n  -- %c ,%x-- \r\n", i1,i1);
      if (i1 == 0x1d && countFileLegth == 0) { // if see file
        nextAgain = 1;
        DataForWrite[0] = 42;
      } else if (i1 == 0x42 && countFileLegth == 0) {
        readStatus = 0;
      }
      if (command_ > 16 && i1 != 0x1d) {
        if ((int)i1 >= 32 && (int)i1 <= 126) {
          DataForWrite[countFileLegth] = i1;
          countFileLegth++;
          time_check = 0;
        } else {
          DataForWrite[countFileLegth] = 42;
          countFileLegth++;
          time_check = 0;
        }
        if (searchStep == 3 && i1 == 0x82) {
          printf("Not found SD-Card\r\n");
        }
      }
    }
    if (countFileLegth >= 32) {
      //printf("length:%d\r\n",countFileLegth);
      //for(j = 0; j < 32; j++)
      //printf("%c\r\n",DataForWrite[j]);
      strcpy(fileLists[maxFile], fileName());
      maxFile++;
      //printf("\r\n%s",fileName());
      if (nextAgain == 1) {
        //printf("nextttttttttttttt\r\n");
        delay_ms(100);
        command_ = 16; //next agian
      }
    }
    time_check++;
    if (time_check > 10000) {
      time_check = 0;
      if (nextAgain == 1) {
        //printf("nextttttttttttttt\r\n");
        delay_ms(100);
        command_ = 16; //next agian
      }
    }
    /*
      else{
      time_check++;
      if(time_check>=102000){
        time_check = 0;
        if(nextAgain == 1){
          printf("L:%d",countFileLegth);
          command_ = 16; //next agian
        }
      }
      }
      if (countFileLegth == 32) {
      strcpy(filelist[r_count], fileName());
      //copy_string(filelist[r_count],(char*)fileName());
      printf("End file this string:%s\r\n", fileName());
      while (countFileLegth > 0) {
        DataForWrite[countFileLegth--] = 0;
      }
      r_count++;
      if (nextAgain == 1) { //if have file
        nextAgain = 0;
      }
      }*/
  }
}
int openDir(char * dirPath) {
  int Open_stats = 1, output = 0;
  char buff[30] = "/";
  command_ = 1;
  //memset(buff,0,30);
  if (strstr(dirPath, "..") != NULL) {
    strcat(buff, dirPath);
  }
  while (Open_stats) {
    if (command_ == 1) {
      if (strlen(buff) > 1) {
        setFilename(buff);
      } else {
        setFilename(dirPath);
      }
      command_++;
      delay_ms(45);
    } else if (command_ == 2) {
      SendCH370(FileOpen, sizeof(FileOpen));
      command_++;
      delay_ms(45);
    }
    if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
      i1 = USART_ReceiveData(USART3);
      printf("%x \r\n", i1);
      if (command_ == 3 && i1 == 0x41) {
        output = 1;
        printf(" status 1 \r\n ");
      } else if (command_ == 3 && i1 == 0x42) { // error not found path
        output = 2;
        printf(" status 2 \r\n ");
      } else {
        output = i1;
      }
      if (command_ == 3) {
        printf("break di\r\n");
        Open_stats = 0;
        //break;
      }
      //printf("\r\n  -- %c ,%x-- \r\n", i1,i1);
    }
  }
  command_ = 99;
  return output;
}
int savePath(char *pathName) {
  char prepareStr[30] = "";
  if (checkSlash(pathName)) {
    //printf("has slash");
  }
  strcpy(prepareStr, "/");
  strcat(prepareStr, pathName);
  if (strlen(Dirpath) == 0)
    strcpy(Dirpath, prepareStr);
  else
    strcat(Dirpath, prepareStr);
  printf("%s", prepareStr);
  return 1;
}
void exitOncePath() {
  int start = countPath(Dirpath);
  int longL = strlen(Dirpath), L = 0;
  //printf("\r\n%d",countPath(Dirpath));
  if (start > 0)
    while (start == countPath(Dirpath)) {
      Dirpath[longL] = 0;
      longL--;
    }

  //printf("\r\n GG : %s",Dirpath);
}
void cdWithPath(char *path) {
  int L = 0;
  char buffer[15] = "";
  int bbuf = 0;
  int root = 1;
  char rootD[15] = "/";
  printf("********************************************\r\n");
  openDir("..");
  while (L < strlen(path)) {
    if (L > 0) {
      if (path[L] == '/') {
        if (root == 1) {
          root = 0;
          strcat(rootD, buffer);
          printf("\r\nbuffer1: %s\r\n", rootD);
          openDir(rootD);
        } else {
          printf("\r\nbuffer2: %s\r\n", buffer);
          openDir(buffer);
        }
        memset(buffer, 0, 15);
        bbuf = 0, L++;
      }
      buffer[bbuf] = path[L];
      bbuf++;
    }
    L++;
    if (L >= 15)
      break;
  }
  openDir(buffer);
  printf("\r\nbuffer3: %s\r\n", buffer);
}
int countPath(char *pathSource) {
  int countPath = 0;
  while (*pathSource) {
    if (*pathSource == '/') {
      countPath++;
    }
    pathSource++;
  }
  return countPath;
}
int checkSlash(char *pathName) {
  int seeS = 0;
  while (*pathName) {
    if (*pathName == '/') {
      seeS = 1;
    }
    pathName++;
  }
  return seeS;
}
void createFileAndWrite(char * fname) {
  command_ = 0;
  command_++;
  while (1) {
    if (createFile(fname) == 1) {
      // printf("Create File TA99 success\r\n");
      break;
    }
  }
  SendCH370(ResetAll, sizeof(ResetAll));
  delay_ms(100);
  command_ = 1;
  //  strcpy(str33,"The Afghan Taliban have rejected calls to extend a three-day ceasefire declared for the Muslim Eid festival. A spokesman said the truce would end on Sunday night and operations against the security forces would resume. Government officials urged the militants not to return to fighting, as dozens of unarmed Taliban exchanged Eid greetings with soldiers and civilians. Meanwhile, at least 18 people were killed in a suicide attack in the city of Jalalabad, officials said. The blast happened outside the office of the governor of Nangarhar province while officials were meeting Taliban insurgents as part of the ceasefire. Dozens were The ceasefire ends tonight and our operations will begin, God willing. We have no intention to extend the ceasefire, said spokesman Zabihullah Mujahid.");
  strcat(str1, str2);
  writeFile4096(fname, str1);
}
void writeFile4096(char * fname, char * strSource) {
  int maxSize = 0, sizeWrite = 128;
  int loop255 = 0;
  int Sloop255 = 0;
  int iL = 0, pp = 0;
  char buffForWrite[128], buffForWrite2[128];
  int WF = 0;
  memset(buffForWrite2, 0, 256);
  maxSize = strlen(strSource);
  loop255 = maxSize / sizeWrite;
  Sloop255 = maxSize % sizeWrite;
  while (iL < loop255) { //
    buffForWrite[pp - iL * sizeWrite] = strSource[pp];
    pp++;
    if (pp % sizeWrite == 0) {
      command_ = 1;
      while (1) { //save 255
        if (fileWrite(WF, fname, buffForWrite) == 1) {
          iL++;
          if (iL == 0)
            WF = 0;
          else
            WF = 1;
          break;
        }
      }
    }
  }
  while ((pp - iL * sizeWrite) < Sloop255) {
    buffForWrite2[pp - iL * sizeWrite] = strSource[pp];
    pp++;
  }
  command_ = 1;
  while (1) { //save 255
    if (fileWrite(WF, fname, buffForWrite2) == 1) {
      break;
    }
  }
}
//---------from john------
int  mapCursor(int P1, int P2, int P3) {
  if (P1 != 0) {
    return  checkBit(P1);
  }
  else if (P2 != 0) {
    return  checkBit(P2) + 8;
  }
  else if (P3 != 0) {
    return  checkBit(P3) + 16;
  } else {
    return 0;
  }
}
int checkBit(int input) {
  int i;
  for (i = 0; i <= 8; i++) {
    if (input == 1)
      break;
    input = input >> 1;
  }
  return i;
}
void saveName() {
  int saving = 1;
  char nameBuff[15];
  char bufferDisplay[20]; // Name:/
  int cc = 1;


