johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
    /*
      Debugger
      printf("\r\n------------------ note.setcursor = %d ----------------------------\r\n ", note.setcursor);

    */

    if (bufferKey3digit[0] == 0x80 && seeCur != 1) {  // delete char in str2
      keyCode = 80; // delete

      /* Debugger

        printf("\r\n------------------------\r\n");
        printf("delete");
        printf("\r\n------------------------\r\n");

      */

    }

    if (keyCode == 80) { // switch mode keycode
      note.keycode = 2;
    }
    else if (keyCode == 60) {
      note.keycode = 3;
      note.state = 0;
      printf("\r\n-----------Left------------\r\n");
      notepad(note.str_ram,note.setcursor, 0, note.keycode);
			note.cursor = strlen(note.Left);
			printf(" \r\n cursorleft = %d\r\n",note.cursor);
			
    }
    else if (keyCode == 70) {
      note.keycode = 4;
      note.state = 1;
      printf("\r\n-----------Right------------\r\n");
      notepad(note.str_ram,note.setcursor, 0, note.keycode);
			note.cursor = strlen(note.Right);
			printf(" \r\n cursorright = %d\r\n",note.cursor);
			
    }
    else {
      note.keycode = 1;
    }
    printf("\r\n------------------------\r\n");
    printf("keycode: %d", note.keycode);
    printf("\r\n------------------------\r\n");

  /*  if (note.keycode == 2) {
      if (note.setcursor != 0) {
        notepad(note.str_ram,note.setcursor, '\0', note.keycode);
      }
      if (note.setcursor == 0) {
        printf("\r\n ------------------------ \r\n");
        printf("end of line");
        printf("\r\n ------------------------ \r\n");
      }
    }*/
    if (bufferKey3digit[1] == 3  && bufferKey3digit[0] == 0) { // joy is up
      keyCode = 32;  // arrow up
      notepad(note.str_ram,note.setcursor, keyCode, note.keycode);
    }




    if ((bufferKey3digit[0] != 0 && keyCode != 32 )) { //  check null spcebar delete
      for ( i = 0; i < 255; i++) {
        if (bufferKey3digit[0]  == unicodeTable[(char) i]) {
          if (seeCur != 1) {
            note.ch = i;
            // select shiftpoint for edit & write || delete str and insert to str_rom
            if (note.shiftpoint >= strlen(note.str_rom) / 20 ) { // endRigjt

              notepad(note.str_ram,note.setcursor, note.ch, note.keycode); // send to notepad // fitst 0 
							
              printf("\r\n First add str mode : %d  is shiftpoint = %d\r\n", note.keycode, note.shiftpoint);
              /*
                Debugger
              */
            }
            else if (note.shiftpoint > 1) { // middle  1 <-> max-1
              if (note.state == 0) {
               // note.keycode = 3;
              }
              if (note.state == 1 ) {
               // note.keycode = 4;

              }

              printf("\r\n middle add str mode : %d  is shiftpoint = %d\r\n", note.keycode, note.shiftpoint);

            }


            else   if (note.shiftpoint == 1) { // Endleft
              //notepad(note.setcursor, note.ch,3);
              printf("\r\n  last  endleft add str mode : %d  is shiftpoint = %d\r\n", note.keycode, note.shiftpoint);
					//	note.setcursor  = strlen(note.Left) - 1;
							//note.cursor = strlen(note.Left)-1;
							printf(" --- cursor ---- %d ",note.cursor); // john5
							notepad(note.Left,note.setcursor,note.ch,note.keycode);
            }


          }
          // printf("%c",i);
          break;
        }
      }
    }
    note.keycode = 0;
    countKey = 0;
    keyCode = 0;
    seeCur = 0;

  }
}
char *copynstr(char *str, char * ch, int size) { // strbuff
  note.buff2 = str;
  note.buff = ch; // copy ch to str
  note.i = 0;
  while (1) {
    *note.buff2 = *note.buff;
    note.buff++;
    note.buff2++;
    note.i++;
    if (note.i == size) {
      break;
    }
  }

  /* //Debugger
    printf("\r\n----------------------------------------------\r\n");
    printf("str copy ch = %s",str);
    printf("\r\nsize_str = %d\r\n",size);/
    printf("\r\n----------------------------------------------\r\n");
  */


}


char *deleteString(char *str, char ch, int setcur) { // delete str is setcur
  //  memset(str + strlen(str) - 1,'\0',1);
  note.buff = str;
  note.i = 0;
  /*    div  strF/index 0 + index(setcur)   strL = /(intdex setcur + strlen(str) */
  while (1) {  // separate str to stfF and strLast
    note.strfirst[note.i]  = *note.buff;  // strf = str index 0 - index setcur
    note.i++;
    note.buff++;
    if (note.i == setcur) {
      note.i = 0;
      while (1) {
        note.strlast[ note.i] = *note.buff;       //
        note.i++;
        note.buff++;
        if ( note.i == setcur + strlen(str)) {
          break;
        }
      }
      break;
    }
  }
  memset(note.strfirst + strlen(note.strfirst) - 1, '\0', 1);
  strcat(note.strfirst, note.strlast);
  strcpy(note.str_ram, note.strfirst);
  memset(note.strfirst, 0, strlen(note.strfirst));
  memset(note.strlast, 0, strlen(note.strlast));

}
char *insertString(char *str, char ch, int setcur) {
  // char *buff; // buffer  = index *buffer = value

  if (setcur == 0) { // insert First str
    // str = aaa
    note.buff = &ch; // ch = A
    strcpy(note.strfirst, note.buff); // F = A
    strcpy(note.strlast, str); //  L =  aaa
    strcat(note.strfirst, note.strlast); // F = A + L = aaa = Aaaa
    strcpy(note.str_ram, note.strfirst); // Aaaa
    memset(note.strfirst, 0, strlen(note.strfirst));
    memset(note.strlast, 0, strlen(note.strlast));
  }
  else {
    note.buff = str;
    note.i = 0;
    /*    div  strF/index 0 + index(setcur)   strL = /(intdex setcur + strlen(str) */
    while (1) {  // separate str to stfF and strLast
      note.strfirst[note.i]  = *note.buff;  // strf = str index 0 - index setcur
      note.i++;
      note.buff++;
      if (note.i == setcur) {
        note.i = 0;
        while (1) {
          note.strlast[ note.i] = *note.buff;       //
          note.i++;
          note.buff++;
          if ( note.i == setcur + strlen(str)) {
            break;
          }
        }
        break;
      }
    }
    note.buff = &ch;
    strcat(note.strfirst, note.buff);
    strcat(note.strfirst, note.strlast);
    strcpy(note.str_ram, note.strfirst);
    memset(note.strfirst, 0, strlen(note.strfirst));
    memset(note.strlast, 0, strlen(note.strlast));

