johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
  }
}

void *addstring(char *str,char ch, int index) { // case 1 add right string
  //  add string in left to right
	 note.buff = str;
  while(*note.buff!='\0'){ // search last str
  	note.buff++;					 //shift position to last str
  }
  *note.buff  = ch;					// add value to str 
  //note.str_ram[index] = ch;
  note.cursor++;
  note.setcursor++;
}
void *addstring2(char ch, int index) { // case 1.2 add middle string
  insertString(note.str_ram, ch, index);
  note.cursor++;
  note.setcursor++;
  if (note.setcursor >=  note.cursor) {
    note.setcursor = note.cursor;
  }
	printf("%s", note.str_ram);
}

void *delstring(char *str,char ch, int index) { // case 2  delete right to left
  //note.str_ram[index] = ch;
	 note.buff = str;
  while(*note.buff!='\0'){ // search last str
  	note.buff++;					 //shift position to last str
  }
	note.buff--;
  *note.buff  = '\0';					// add value to str 
  note.cursor--;
  note.setcursor--;
}
void *delstring2(char ch, int index) { // case 2.1  delete middle to left string
  deleteString(note.str_ram, ch, index);
  note.cursor--;
  note.setcursor--;
  if (note.setcursor >=  note.cursor) {
    note.setcursor = note.cursor;
  }
}

void *rightstring() {
  //  note.j = 0; // endright   start 0 - 20
  memset(note.Right, 0, strlen(note.Right));
	printf("\r\n-----------------------\r\n");
  printf("End Right");
  printf("\r\n-----------------------\r\n");
  note.j = strlen(note.str_rom) - 20;
  copynstr(note.Right, note.str_rom + note.j , 20);	
//	memset(note.Right, 0, strlen(note.Right));
}

void *rightstring2() {
   memset(note.Right, 0, strlen(note.Right));
	 note.shiftpoint++;
  copynstr(note.Right, note.str_rom + abs((note.j += 20)), 20); //  start 20 - next +20 ->>>>>
	//memset(note.Right, 0, strlen(note.Right));
}

void *leftstring() {
  memset(note.Left, 0, strlen(note.Left));
  printf("\r\n-----------------------\r\n");
  printf("End Left");
  printf("\r\n-----------------------\r\n");
  note.j = 0;
  copynstr(note.Left, note.str_rom + note.j, 20); // end left 0-20 start 0 - 20	
 //memset(note.Left, 0, strlen(note.Left));
}
void *leftstring2() {
  memset(note.Left, 0, strlen(note.Left));
	 note.shiftpoint--;
  note.j = abs(note.j - 20);
  copynstr(note.Left, note.str_rom + note.j, 20); //  start 20 - next +20
//	memset(note.Left, 0, strlen(note.Left));

}
void *Enddisplay() {
  strcat(note.str_rom, note.str_ram); // move string str_ram to str_rom
  printf(" \r\n -----str_rom----- \r\n");
  printf("%s", note.str_rom);
  printf(" \r\n -----str_rom----- \r\n");
  note.cursor = 0; // clear cursor
  note.setcursor = 0;
  note.shiftpoint = strlen(note.str_rom) / 20;      // shifpoint =  str/20
  note.j = 0;  //  reset shiftLeftstr
//  memset(note.str_ram, '\0', strlen(note.str_ram)); // clear str_ram
}

void notepad(char *selectstr,int setcursor, char str, int keycode) {

  if (note.cursor == 20) {
    Enddisplay();
  }

  switch (keycode) {
    //  case 1 add string is Left to Right
    case 1 :
      if (setcursor >= note.cursor) {
        addstring(selectstr,str, note.cursor);
				printf("\r\n ---- stradd = %s ----\r\n",selectstr);
				
      }
      else if (setcursor < note.cursor) { // insert string befor lastcursor  by setcursor
        addstring2(str, setcursor);
      }
      break;  // end case 1
    case 2 :
      if (setcursor >= note.cursor && note.cursor > 0 ) { // delete string in right to left
        delstring(selectstr,str, note.cursor);
				
					printf("\r\n ---- strdelete = %s ----\r\n",selectstr);
      }
      else if (setcursor < note.cursor && note.cursor > 0  ) { // insert string befor lastcursor  by setcursor
        delstring2(str, setcursor);
      }

      break;
    case 3:   // shift Left


      if (note.shiftpoint == 0) {
        printf("\r\n-----------------------\r\n");
        printf("str_rom  < 20");
        printf("\r\n-----------------------\r\n");
      }
      if (note.shiftpoint == 1) { // End Left   EndLeft = 1 << str_rom >> EndRight  = strlen(str_rom)
        //printf("\r\n ----- leftstring ---------- \r\n");
        leftstring();
				printf("\r\n ---endLeft = :%s--- \r\n",note.Left);
				memset(note.Left,0,strlen(note.Left));

      }
      if (note.shiftpoint > 1) {
        //printf("\r\n ----- leftstring2 ---------- \r\n");
				
        leftstring2();
				printf("\r\n --- left is %d = :%s--- \r\n",note.shiftpoint,note.Left);
					memset(note.Left,0,strlen(note.Left));
      }
      break;

    case 4:   // shift  Right

      if (note.shiftpoint == 0) {

        printf("\r\n-----------------------\r\n");
        printf("str_rom  < 20");
        printf("\r\n-----------------------\r\n");

      }

      else  if (note.shiftpoint == strlen(note.str_rom) / 20) { // end right
        //  printf("\r\n ----- rightstring ---------- \r\n");
        rightstring();
				printf("\r\n ---endRight = :%s--- \r\n",note.Right);
					memset(note.Right,0,strlen(note.Right));
      }
      else if (note.shiftpoint != strlen(note.str_rom) / 20) {
        //  printf("\r\n ----- rightstring2 ---------- \r\n");
        rightstring2();
				printf("\r\n --- Right is %d = :%s--- \r\n",note.shiftpoint,note.Right);
				memset(note.Right,0,strlen(note.Right));
      }

      /* Debugger

        printf("\r\n-----------------------\r\n");
        printf("shiftpoint = %d", note.shiftpoint);
        printf("\r\n-----------------------\r\n");
        printf(" \r\n -----str_rom----- \r\n");
        printf("%s", note.str_rom);
        printf(" \r\n -----str_rom----- \r\n");
      */

      break;


    default : printf("\r\n ------------ error -------------\r\n");
     break;
  }
}


//-----------new----------

void stringToUnicodeAndSendToDisplay(char *string) {
  int strleng = 0;
  configDisplay();
  //clearDot();
  for (j = 0; j < 20 && string[j] != '\0' && string[j] != 0x0a; j++) {
    strleng++;
  }
  printf("| %s \r\n", string);
  SPI_DISPLAY_CS_LOW();

  for (j = 20; j >= 0; j--) {
    if (j < strleng) {
      Delay(0x55F);
      cell_sentdata(~unicodeTable[((int) * (string + j))]); //send to display
      printf(" %c unicode:%x ascii:%d lum: %d\r\n", *(string + j), unicodeTable[((int) * (string + j))], (int) * (string + j), j);
    }
    else {
      cell_sentdata(0xff); // null dot send to display
    }
  }
  SPI_DISPLAY_CS_HIGH();
  Delay(0x55F);
}
void stringToUnicodeAndSendToDisplayC(char *string, int po) { //cur position
  int strleng = 0;
  configDisplay();
  //clearDot();
  for (j = 0; j < 20 && string[j] != '\0' && string[j] != 0x0a; j++) {
    strleng++;
  }
  printf("| %s \r\n", string);
  SPI_DISPLAY_CS_LOW();

  for (j = 20; j >= 0; j--) {
    if (j == po) {
      cell_sentdata((~unicodeTable[((int) * (string + j))] & (~0xc0))); //curPostion
    }
    else if (j < strleng) {
      Delay(0x55F);
      cell_sentdata(~unicodeTable[((int) * (string + j))]); //send to display
      printf(" %c unicode:%x ascii:%d lum: %d\r\n", *(string + j), unicodeTable[((int) * (string + j))], (int) * (string + j), j);
    }
    else if (strleng == 0 && j == 0) {
      cell_sentdata((~0xc0)); //first position
    }
    else {
      cell_sentdata(0xff); // null dot send to display
    }
  }
  SPI_DISPLAY_CS_HIGH();
  Delay(0x55F);
}
void appendFile() {

