johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
  if (command_ == 1) {
    SendCH370(checkConnection, sizeof(checkConnection));
    command_++; //2
    printf("WrilteFile \r\n Check Connection\r\n");
  } else if (command_ == 3) {
    SendCH370(setSDCard, sizeof(setSDCard));
    printf("Set SD Card Mode\r\n");
    command_++; //4
  } else if (command_ == 5) {
    SendCH370(USBDiskMount, sizeof(USBDiskMount));
    printf(" DiskMount R:%d\r\n", command_);
    command_++; //6
  } else if (command_ == 7) {
    SendCH370(setFileName, sizeof(setFileName));
    printf("Set File Name\r\n");
    command_++; //8
  } else if (command_ == 9) {
    SendCH370(FileOpen, sizeof(FileOpen));
    printf("File Open\r\n");
    command_++; //10
  }
  else if (command_ == 11) {
    SendCH370(FilePointer, sizeof(FilePointer));
    printf("Pointer\n");
    command_++; //12
  } else if (command_ == 13) {
    //    SendCH370(FileLength, sizeof(FileLength));
    printf("File Length\r\n");
    command_++; //14
  }
  else if (command_ == 15) {
    SendCH370(FileWrite, sizeof(FileWrite));
    printf("File Write\r\n");
    command_++; //16
  }
  else if (command_ == 17) {
    SendCH370(FileUpdate, sizeof(FileUpdate));
    printf("File Update\r\n");
    command_++; //18

  }
  else if (command_ == 19) {
    SendCH370(FileClose, sizeof(FileClose));
    printf("File Closed\r\n");
    command_++; //20
  }
  menu_s();
  //  SendCH370(checkConnection,sizeof(checkConnection));
  if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART3);
    printf("%x\r\n", i1);
  }
}
void NextFile() {
  SendCH370(enumgo, sizeof(enumgo));
  // delay_ms(45);
  SendCH370(data0, sizeof(data0));
  //delay_ms(100);
  printf("\r\nNext File\r\n");
}
void setFileLength(char * str___) {
  int jjr = 0;
  int FileLength222[] = {0x00, 0x57, 0xab, 0x3c, 0x00, 0x00};
  while (str___[jjr] != '\0') {
    jjr++;
  }
  if (jjr > 128) {
    jjr = 128;
  }
  FileLength222[4] = jjr;
  printf("\r\n str length2 in set file length:%d \r\n", FileLength222[4]);
  SendCH370(FileLength222, sizeof(FileLength222));
}
void setFileWrite(char * str) {
  SendCH370(FileWrite, sizeof(FileWrite));
  sendUart(3);
  printf("%s", str);
  sendUart(1);
}
int fileWrite(int k, char * filename, char * string__) {

  int status = 0;
  if (command_ == 1) {
    SendCH370(checkConnection, sizeof(checkConnection));
    command_++; //2
    // printf("Check Connection\r\n");
    delay_ms(50);
  } else if (command_ == 2) {
    SendCH370(setSDCard, sizeof(setSDCard));
    // printf("Set SD Card Mode\r\n");
    command_++; //4
    delay_ms(50);
  } else if (command_ == 3) {
    SendCH370(USBDiskMount, sizeof(USBDiskMount));
    //printf(" DiskMount R:%d\r\n", command_);
    command_++; //6
    delay_ms(50);
  } else if (command_ == 4) {
    setFilename(filename);
    // printf("Set File Name\r\n");
    command_++; //8
    delay_ms(50);
  } else if (command_ == 5) {
    SendCH370(FileOpen, sizeof(FileOpen));
    // printf("File Open\r\n");
    command_++; //10
    delay_ms(50);
  }
  else if (command_ == 6) {
    if (k == 0) // head
      SendCH370(FilePointer, sizeof(FilePointer));
    else
      SendCH370(FilePointerend, sizeof(FilePointerend));
    // printf("Pointer\n");
    command_++; //12
    delay_ms(50);
  } else if (command_ == 7) { //FileLength

    setFileLength(string__);
    //  printf("File Length--\r\n");
    command_++; //14
    delay_ms(50);
  }
  else if (command_ == 8) {
    setFileWrite(string__);
    // printf("File Write\r\n");
    command_++; //16
    delay_ms(50);
  }
  else if (command_ == 9) {
    SendCH370(FileUpdate, sizeof(FileUpdate));
    // printf("File Update\r\n");
    command_++; //18
    delay_ms(50);
  }
  else if (command_ == 10) {
    SendCH370(FileClose, sizeof(FileClose));
    //  printf("File Closed\r\n");
    command_++; //20
    delay_ms(50);
  }
  if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART3);
    //  printf("%x\r\n", i1);
    if (i1 == 0x14 && command_ == 11) {
      status = 1;
    }
  }

  return status;
}
void searchFile() {
  command_ = 0;
  r_count = 0;
  printf("Seaching............................\r\n");
  //SendCH370(ResetAll, sizeof(ResetAll)); //reset chip
  printf("reset all\r\n");
  delay_ms(50);
  command_++;
  while (seaching == 1) {
    if (command_ == 1) {
      searchStep++;//1
      SendCH370(checkConnection, sizeof(checkConnection));
      printf("Check Connection str %s\r\n", FileName_buffer);
      command_++; //2
      delay_ms(45);
    } else if (command_ == 2) {
      searchStep++;//2
      SendCH370(setSDCard, sizeof(setSDCard));
      printf("Set SD Card Mode\r\n");
      command_++; //4
      delay_ms(45);
    } else if (command_ == 3) {
      searchStep++;//3
      SendCH370(USBDiskMount, sizeof(USBDiskMount));
      printf(" USB Disk Mount\r\n");
      command_++; //6
      delay_ms(45);
    } else if (command_ == 4) {
      searchStep++;//5
      SendCH370(setAllName, sizeof(setAllName));
      printf("Set File Name\r\n");
      command_++; //8
      delay_ms(45);
    } else if (command_ == 5) { ///FileOpen
      searchStep++;//6
      SendCH370(FileOpen, sizeof(FileOpen));
      printf("File Open\r\n");
      command_++; //7
      delay_ms(45);
    }
    else if (command_ == 6) {
      searchStep++;
      NextFile();
      stepCount = 0;
      countFileLegth = 0;
      command_++;
      //delay_ms(50);
    } else if (command_ == 99) {
      command_ = 6;
      searchStep = 5;
      countFileLegth = 0;
    }
    menu_s();
    if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
      i1 = USART_ReceiveData(USART3);
      //// printf("\r\n  -- %x -- \r\n", i1);
      stepCount++;
      if (i1 == 0x42 && countFileLegth == 0) { // end file
        // printf("End read %d file\r\n", r_count);
        if (r_count == 0) {
          strcpy(filelist[0], "Back and enter again");
          r_count = 1;
        }
        printf("=======================================\r\n");
        for (i = 0; i < r_count; i++) {
          printf("%s\r\n", filelist[i]);
          //stringToUnicodeAndSendToDisplay(filelist[i]);
        }
        printf("=======================================\r\n");
        //seaching = 0;
      }
      if (i1 == 0x1d && countFileLegth == 0) { // if see file
        nextAgain = 1;
        DataForWrite[0] = 42;
      }
      if ((int)i1 >= 32 && (int)i1 <= 126) {
        DataForWrite[countFileLegth] = i1;
      } else {
        DataForWrite[countFileLegth] = 42;
      }
      countFileLegth++;
      if (i1 == 0xa8) {
        printf("OK\r\n");
      } else if (i1 == 0x51) {
        printf(" Set SD Card OK\r\n");
      } else if (i1 == 0x14) {
        printf("Success\r\n");
      } else if (i1 == 0x82) {
        printf("Error\r\n");
        //strcpy(filelist[0], "Please check your SD");
        r_count = 1;
      } else if (i1 == 0xFF) {
        printf("Success\r\n");
      }
      if (searchStep == 3 && i1 == 0x82)
        printf("Not found SD-Card\r\n");
    }
    if (countFileLegth == 32) {
      strcpy(filelist[r_count], fileName());
      //copy_string(filelist[r_count],(char*)fileName());
      printf("End file this string:%s\r\n", fileName());
      while (countFileLegth > 0) {
        DataForWrite[countFileLegth--] = 0;
      }
      r_count++;
      if (nextAgain == 1) { //if have file
        nextAgain = 0;
        command_ = 99;
        //printf("Preprrrr");
      }
    }
  }
  printf("breaked from search file func.\r\n");
}
void copy_string(char *target, char *source) {
  while (*source) {
    *target = *source;
    source++;
    target++;
  }
  *target = '\0';
}
void writeFlash(int address, int size) {
  configFlash();
  SPI_FLASH_CS_LOW();
  SST25_W_BLOCK(address, SST25_buffer, 4096);
  SPI_FLASH_CS_HIGH();
}
void writeFlash2(int address, int size) {
  configFlash();
  SPI_FLASH_CS_LOW();
  SST25_W_BLOCK(address, SST25_buffer99, 4096);
  //printf("---test-----%s",SST25_buffer);
  SPI_FLASH_CS_HIGH();
}
void ReadFile() { //readf
  stringToUnicodeAndSendToDisplay("Reading....");
  command_ = 0;
  r_count = 0;
  //SendCH370(ResetAll, sizeof(ResetAll)); //reset chip
  printf("reset all\r\n");
  delay_ms(50);
  command_++;
  while (readstatus == 1) {
    if (command_ == 1) {
      SendCH370(checkConnection, sizeof(checkConnection));
      command_++; //2
      delay_ms(50);
      // printf("Check Connection str %d\r\n",myFunction());
    } else if (command_ == 2) {
      SendCH370(setSDCard, sizeof(setSDCard));
      printf("Set SD Card Mode\r\n");
      command_++; //3
      delay_ms(50);
    } else if (command_ == 3) {
      SendCH370(USBDiskMount, sizeof(USBDiskMount));
      printf("USB Disk Mount\r\n");
      command_++; //4
      delay_ms(50);
    } else if (command_ == 4) {
      SendCH370(setFileName, sizeof(setFileName));
      printf("Set file Name\r\n");
      command_++; //5
      delay_ms(50);
    } else if (command_ == 5) { ///FileOpen
      SendCH370(FileOpen, sizeof(FileOpen));
      printf("File Open\r\n");
      command_++; //6
      delay_ms(50);
    } else if (command_ == 6) {
      SendCH370(SetByteRead, sizeof(SetByteRead)); //result 1D can read
      //printf("Check for reading File\r\n");
      command_ = 99;
      delay_ms(50);
    } else if (command_ == 95) { //left (prevois line)
      SendCH370(continueRead, sizeof(continueRead));
      //printf("continue Read\r\n");
      command_++; //96
    }
    else if (command_ == 98) { //right (next line)
      command_ = 6;
    } else if (command_ == 99) {
      SendCH370(ReadData, sizeof(ReadData));
      // printf("Reading File\r\n");
      command_++;
    }
    menu_s();
    if (USART_GetITStatus(USART3, USART_IT_RXNE) ) {
      i1 = USART_ReceiveData(USART3);
      printf("%c", i1);
      if (command_ == 96 && i1 == 0x14) {
        command_ = 6;
        printf("\r\n----------read New Sector-------------------- \r\n");
      }
      if (i1 == 0x80 || i1 == 0x14) {
        // printf("funk\r\n");
      }
      else if (command_ == 100 && countSector512 < 4 && countdataTemp512 < 512) {
        if (i1 == '\0') {
          printf("End of File\r\n");
        }
        else if (countdataTemp512 < ((128) * (countSector512 + 1)) - 1) { //128
          dataTemp512[countdataTemp512] = i1;
          countdataTemp512++;
          strLength++;
          waitEnd = 0;
          lastAscii = i1;
        } else {
          countSector512++;
          dataTemp512[countdataTemp512] = i1;
          countdataTemp512++;
          // printf("`````````````````````````one sector %d````````````````\r\n%s\r\n", countdataTemp512, dataTemp512);

