johnR46/BellLab_STM32/V5/ADC+DMA/USER/main.c
}
void clearDot() {
  SPI_DISPLAY_CS_LOW();
  Delay(0x55F);
  for (j = 20; j >= 0; j--) {
    cell_sentdata(0xff);
  }
  SPI_DISPLAY_CS_HIGH();
  Delay(0x55F);
}
void  Delay(uint32_t nCount)
{
  for (; nCount != 0; nCount--);
}
uint8_t Flash_ReadWriteByte2(uint8_t data)
{
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);

  /* Send byte through the SPI1 peripheral */
  SPI_I2S_SendData(SPI1, data);

  /* Wait to receive a byte */
  //while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);

  /* Return the byte read from the SPI bus */
  return SPI_I2S_ReceiveData(SPI1);
}
void Init_SPI(void)
{
  SPI_InitTypeDef  SPI_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_SPI_FLASH_CS, ENABLE);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; //dot display 10MHz
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4; //dot display
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4; //spi flash
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  SPI_FLASH_CS_HIGH();
  SPI_DISPLAY_CS_HIGH();
  /* SPI1 Config -------------------------------------------------------------*/

  /* Enable SPI1 */
  SPI_Cmd(SPI1, ENABLE);
  SPI_I2S_ClearFlag(SPI1, SPI_I2S_FLAG_TXE);
  //SPI_DISPLAY_CS_LOW();
}
void sentdata_cell(int data) {
  //for (i = 0; i < 1; i++) {

  Flash_ReadWriteByte2(data);
  Delay(0x25F);
  // }
}
void cell_sentdata(int cell) {
  //SPI_DISPLAY_CS_LOW();
  // Delay(0x55F);
  sentdata_cell(cell);
  //    Delay(0x005e0);
  // SPI_DISPLAY_CS_HIGH();
  //Delay(0x55F);
}
void delay_SPI() {
  Delay(0xfffff);
}
void Uart2ReceiveKeyCode() {
  sendUart(1);
  if ( USART_GetITStatus(USART2, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART2);
    //printf("%c", k);
    if (i1 == 'H') { //check first byte
      isHex = 1;   //equal 1 is hex
    } else if (i1 == 'S') {
      isHex = 2; // equal 2 is Switch
    }
    if (i1 != 'F' && i1 != '\r' && i1 != '\n') {
      if (i1 != 'S' && i1 != 'H') {

        buffer[count1++] = (char)i1;

        //printf("%c", i);
      }
    } else { //after store buffer
      if (isHex == 2) {
        printf("Switch input : %s\r\n", buffer); //debug via USART 1

        //Example Switch
        // index 0 is '0' use index 1 for check condition
        if (buffer[1] == '3') {
          printf("Nav Left\r\n");
          SendCommandToBLE(navLeft, sizeof(navLeft));
        }
        if (buffer[1] == 'C') {
          printf("Nav Right\r\n");
          SendCommandToBLE(navRight, sizeof(navRight));
        }
        // do  something
        //
        //
        //
        //
        //
        //
        //
      } else if (isHex == 1) {
        // converts to hex//
        while (buffer[j1] != '\0') {
          if (buffer != 0) {
            Hex = buffer[j1];
          }
          j1++;
          if (j1 > 6) {
            break;
          }
        }
        j1 = 0;
        // end converst
        printf("Hex input : %s Hex is %x \r\n", buffer, Hex);
        // do something with hex
        //
        //
        //
        //
        //
        //
        //
      }
      //printf("%s",buffer);
      //** clear buffer string **//
      itFirst = 0;
      count1 = 0;
      isHex = 0;
      memset(buffer, 0, sizeof(buffer));
      //////////////////////////////
    }
  }
  sendUart(0);
  //printf("%s\r\n",buffer);
  //memset(buffer, 0, sizeof(buffer));
  //  printf("%c",USART_ReceiveData(USART2));
  //  printf("%c",USART_ReceiveData(USART2));
  //
}
void keyboardMode() {
  sendUart(1);
  if (USART_GetITStatus(USART2, USART_IT_RXNE) ) {
    i1 = USART_ReceiveData(USART2);
    if (i1 == 0xff && seeHead == 0) {
      seeHead = 1;
      countKey = 0;
    }
    keyCodeRecieve[countKey++] = i1;
    //printf("%x",i1);
    //SendCommandToBLE2(i1);
  }
  if (countKey >= maxData) {
    SendCommandToBLE(keyCodeRecieve, sizeof(keyCodeRecieve));
    seeHead = 0;
    //int navLeft[] = {0xff, 0xff, 0xa6, 0x03, 0x00, 0x04, 0x00};
    for ( j = 0 ; j < 7 ; j++) {
      printf("%c", keyCodeRecieve[j]);
    }
    countKey = 0;
  }
}
void BluetoothMode() {
  if (USART_GetITStatus(UART4, USART_IT_RXNE)) { //if serial available
    hexbuffer = USART_ReceiveData(UART4);
    if (hexbuffer == 0xff && SeeHead == 0) {
      SeeHead = 1;
      count = 0;
      dataLength = 0;
    }
    if (count >= 23 && SeeHead == 1) {
      SeeHead = 0;
      pushToDisplay = 1;
    }
    BLEConBuffer[count] = hexbuffer;
    count++;
    if (count > 1 && BLEConn == 0) { //
      if (BLEConBuffer[0] == 0xff && BLEConBuffer[1] == 0xff && BLEConBuffer[2] == 0xa1 && BLEConn == 0) { //connect
        ConnectBLE();
        countConn++;
        if (countConn == 2) {
          BLEConn = 1;
          becon = 1;
        }
        count = 0;
      }
    }
  } else {
    sendUart(1);
    if (pushToDisplay == 1) {
      SPI_DISPLAY_CS_LOW();
      Delay(0x55F);
      for (j = 20; j >= 0; j--) {
        cell_sentdata(0xff);
      }
      SPI_DISPLAY_CS_HIGH();
      Delay(0x55F);
      for (j = 23; j >= 0; j--) {
        if (USART_GetITStatus(UART4, USART_IT_RXNE)) {
          if (BLEConn != 0) {
            count = 0;
          }
          break;
        } else { //------------------ send to braille display ----------------------
          hexPrep = BLEConBuffer[j];
          if (hexPrep != 0xff && hexPrep != 0xa3 && hexPrep != 0x14) { //ff ff 3a
            cell_sentdata(~hexPrep);
          }
        }
      }
      pushToDisplay = 0;
      count = 0;
    }
  }
}
void ConnectBLE() {
  int x = 0;
  while (x < sizeof(connectData) / sizeof(int))
  {
    USART_SendData(UART4, connectData[x++]);
    while (USART_GetFlagStatus(UART4, USART_FLAG_TC) == RESET)
    {
    }
  }
}
void SendCommandToBLE2(int data) {
  USART_SendData(UART4, data);
  while (USART_GetFlagStatus(UART4, USART_FLAG_TC) == RESET)
  {
  }
}
void SendCH370(int data[], int sizeOfData) {
  int x  = 0;
  while (x < sizeOfData / sizeof(int))
  {
    USART_SendData(USART3, data[x++]);
    while (USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET)
    {
    }
  }
}
void SendCommandToBLE(int data[], int sizeOfData) {
  int x  = 0;
  while (x < sizeOfData / sizeof(int))
  {
    USART_SendData(UART4, data[x++]);
    while (USART_GetFlagStatus(UART4, USART_FLAG_TC) == RESET)
    {
    }
  }
}
void UARTSend(const unsigned char *pucBuffer, unsigned long ulCount)  //UARTSend(menu,sizeof(menu));
{
  while (ulCount--)
  {
    USART_SendData(USART1, *pucBuffer++);
    while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
    {
    }
  }
}

void UART4Send(const unsigned char *pucBuffer, unsigned long ulCount)  //UARTSend(menu,sizeof(menu));
{
  while (ulCount--)
  {
    USART_SendData(UART4, *pucBuffer++);
    while (USART_GetFlagStatus(UART4, USART_FLAG_TC) == RESET)
    {
    }
  }
}
/*******************************************************************************
  Function Name  : GPIO_Configuration
  Description    : Configures the different GPIO ports.
  Input          : None
  Output         : None
  Return         : None
  Attention    : None
*******************************************************************************/
void sendUart(int data) {
  sendUart1 = 0;
  sendUart2 = 0;
  sendUart3 = 0;
  sendUart4 = 0;
  switch (data) {
    case 1: sendUart1 = 1; break;
    case 2: sendUart2 = 1; break;
    case 3: sendUart3 = 1; break;
    case 4: sendUart4 = 1; break;
    default :
      sendUart1 = 0;
      sendUart2 = 0;
      sendUart3 = 0;
      sendUart4 = 0;
      break;
  }
}

void GPIO_Configuration(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOB , ENABLE);
  /* Configure PB.02 (ADC Channel8) as analog input -------------------------*/
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
}

